{"format": "graph-model", "generatedBy": "2.2.0-rc2", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"input": {"name": "input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "720"}, {"size": "720"}, {"size": "3"}]}}}, "outputs": {"add_1": {"name": "add_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "720"}, {"size": "720"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "depthwise_5/filter_in", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "1"}]}}}}}, {"name": "ConstantFolding/truediv_5_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "720"}, {"size": "720"}, {"size": "1"}]}}}}}, {"name": "depthwise_3/filter_in", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/truediv_2_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "720"}, {"size": "720"}, {"size": "1"}]}}}}}, {"name": "generator/block_3/conv1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/block_3/conv1/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "generator/block_3/conv2/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "generator/block_3/conv2/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "generator/block_2/conv1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/block_2/conv1/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "generator/block_2/conv2/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "generator/block_2/conv2/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "generator/block_1/conv1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/block_1/conv1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/block_1/conv2/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "generator/block_1/conv2/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/block_0/conv1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/block_0/conv1/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "generator/block_0/conv2/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "generator/block_0/conv2/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/Conv_3/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/Conv_3/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/Conv_4/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}}}, {"name": "generator/Conv_4/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "generator/Conv_5/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/Conv_5/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/ResizeBilinear/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "generator/Conv_1/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}}}, {"name": "generator/Conv_1/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "generator/Conv_2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/Conv_2/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/Conv_6/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "generator/Conv_6/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/Conv_7/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "32"}]}}}}}, {"name": "generator/Conv_7/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "generator/ResizeBilinear_1/size", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "generator/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/Conv/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "generator/Conv_8/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}}}, {"name": "generator/Conv_8/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/Conv_9/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "32"}, {"size": "3"}]}}}}}, {"name": "generator/Conv_9/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "depthwise_2/filter_in", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/truediv_1_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "720"}, {"size": "720"}, {"size": "1"}]}}}}}, {"name": "depthwise_4/filter_in", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "1"}]}}}}}, {"name": "ConstantFolding/truediv_3_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "720"}, {"size": "720"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "depthwise_1/filter_in", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "720"}, {"size": "720"}, {"size": "1"}]}}}}}, {"name": "depthwise_6/filter_in", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "1"}]}}}}}, {"name": "ConstantFolding/truediv_6_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "720"}, {"size": "720"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "1"}, {"size": "720"}, {"size": "720"}, {"size": "3"}]}}}}, {"name": "generator/LeakyRelu", "op": "_FusedConv2D", "input": ["input", "generator/Conv/weights", "generator/Conv/biases"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "data_format": {"s": "TkhXQw=="}, "leakyrelu_alpha": {"f": 0.2}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}}}, {"name": "ArithmeticOptimizer/ReplaceMulWithSquare_mul_2", "op": "Square", "input": ["input"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "depthwise_1", "op": "DepthwiseConv2dNative", "input": ["input", "depthwise_1/filter_in"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "generator/LeakyRelu_1", "op": "_FusedConv2D", "input": ["generator/LeakyRelu", "generator/Conv_1/weights", "generator/Conv_1/biases"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "depthwise_4", "op": "DepthwiseConv2dNative", "input": ["ArithmeticOptimizer/ReplaceMulWithSquare_mul_2", "depthwise_4/filter_in"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "truediv", "op": "Mul", "input": ["depthwise_1", "ConstantFolding/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/LeakyRelu_2", "op": "_FusedConv2D", "input": ["generator/LeakyRelu_1", "generator/Conv_2/weights", "generator/Conv_2/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "truediv_3", "op": "Mul", "input": ["depthwise_4", "ConstantFolding/truediv_3_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ArithmeticOptimizer/ReplaceMulWithSquare_mul_3", "op": "Square", "input": ["truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/LeakyRelu_3", "op": "_FusedConv2D", "input": ["generator/LeakyRelu_2", "generator/Conv_3/weights", "generator/Conv_3/biases"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "sub_1", "op": "Sub", "input": ["add/y", "ArithmeticOptimizer/ReplaceMulWithSquare_mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/LeakyRelu_4", "op": "_FusedConv2D", "input": ["generator/LeakyRelu_3", "generator/Conv_4/weights", "generator/Conv_4/biases"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}}}, {"name": "add", "op": "Add", "input": ["truediv_3", "sub_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/block_0/LeakyRelu", "op": "_FusedConv2D", "input": ["generator/LeakyRelu_4", "generator/block_0/conv1/weights", "generator/block_0/conv1/biases"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}}}, {"name": "generator/block_0/conv2/BiasAdd", "op": "_FusedConv2D", "input": ["generator/block_0/LeakyRelu", "generator/block_0/conv2/weights", "generator/block_0/conv2/biases"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "generator/block_0/add", "op": "AddV2", "input": ["generator/block_0/conv2/BiasAdd", "generator/LeakyRelu_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/block_1/LeakyRelu", "op": "_FusedConv2D", "input": ["generator/block_0/add", "generator/block_1/conv1/weights", "generator/block_1/conv1/biases"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "leakyrelu_alpha": {"f": 0.2}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}}}, {"name": "generator/block_1/conv2/BiasAdd", "op": "_FusedConv2D", "input": ["generator/block_1/LeakyRelu", "generator/block_1/conv2/weights", "generator/block_1/conv2/biases"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}}}, {"name": "generator/block_1/add", "op": "AddV2", "input": ["generator/block_1/conv2/BiasAdd", "generator/block_0/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/block_2/LeakyRelu", "op": "_FusedConv2D", "input": ["generator/block_1/add", "generator/block_2/conv1/weights", "generator/block_2/conv1/biases"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "generator/block_2/conv2/BiasAdd", "op": "_FusedConv2D", "input": ["generator/block_2/LeakyRelu", "generator/block_2/conv2/weights", "generator/block_2/conv2/biases"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator/block_2/add", "op": "AddV2", "input": ["generator/block_2/conv2/BiasAdd", "generator/block_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/block_3/LeakyRelu", "op": "_FusedConv2D", "input": ["generator/block_2/add", "generator/block_3/conv1/weights", "generator/block_3/conv1/biases"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}}}, {"name": "generator/block_3/conv2/BiasAdd", "op": "_FusedConv2D", "input": ["generator/block_3/LeakyRelu", "generator/block_3/conv2/weights", "generator/block_3/conv2/biases"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "generator/block_3/add", "op": "AddV2", "input": ["generator/block_3/conv2/BiasAdd", "generator/block_2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/LeakyRelu_5", "op": "_FusedConv2D", "input": ["generator/block_3/add", "generator/Conv_5/weights", "generator/Conv_5/biases"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator/ResizeBilinear", "op": "ResizeBilinear", "input": ["generator/LeakyRelu_5", "generator/ResizeBilinear/size"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator/add", "op": "AddV2", "input": ["generator/ResizeBilinear", "generator/LeakyRelu_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/LeakyRelu_6", "op": "_FusedConv2D", "input": ["generator/add", "generator/Conv_6/weights", "generator/Conv_6/biases"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "generator/LeakyRelu_7", "op": "_FusedConv2D", "input": ["generator/LeakyRelu_6", "generator/Conv_7/weights", "generator/Conv_7/biases"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "leakyrelu_alpha": {"f": 0.2}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "generator/ResizeBilinear_1", "op": "ResizeBilinear", "input": ["generator/LeakyRelu_7", "generator/ResizeBilinear_1/size"], "attr": {"half_pixel_centers": {"b": false}, "T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}}}, {"name": "generator/add_1", "op": "AddV2", "input": ["generator/ResizeBilinear_1", "generator/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/LeakyRelu_8", "op": "_FusedConv2D", "input": ["generator/add_1", "generator/Conv_8/weights", "generator/Conv_8/biases"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator/Conv_9/BiasAdd", "op": "_FusedConv2D", "input": ["generator/LeakyRelu_8", "generator/Conv_9/weights", "generator/Conv_9/biases"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "depthwise_2", "op": "DepthwiseConv2dNative", "input": ["generator/Conv_9/BiasAdd", "depthwise_2/filter_in"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "mul", "op": "Mul", "input": ["input", "generator/Conv_9/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_1", "op": "Mul", "input": ["depthwise_2", "ConstantFolding/truediv_1_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "depthwise_3", "op": "DepthwiseConv2dNative", "input": ["mul", "depthwise_3/filter_in"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "mul_1", "op": "Mul", "input": ["truediv", "truediv_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_2", "op": "Mul", "input": ["depthwise_3", "ConstantFolding/truediv_2_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub", "op": "Sub", "input": ["truediv_2", "mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_4", "op": "RealDiv", "input": ["sub", "add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "depthwise_5", "op": "DepthwiseConv2dNative", "input": ["truediv_4", "depthwise_5/filter_in"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "mul_4", "op": "Mul", "input": ["truediv_4", "truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_5", "op": "Mul", "input": ["depthwise_5", "ConstantFolding/truediv_5_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_2", "op": "Sub", "input": ["truediv_1", "mul_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_5", "op": "Mul", "input": ["truediv_5", "input"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "depthwise_6", "op": "DepthwiseConv2dNative", "input": ["sub_2", "depthwise_6/filter_in"], "attr": {"explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "truediv_6", "op": "Mul", "input": ["depthwise_6", "ConstantFolding/truediv_6_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add_1", "op": "AddV2", "input": ["mul_5", "truediv_6"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1087}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "depthwise_5/filter_in", "shape": [3, 3, 3, 1], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "ConstantFolding/truediv_5_recip", "shape": [1, 720, 720, 1], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "depthwise_3/filter_in", "shape": [3, 3, 3, 1], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "ConstantFolding/truediv_2_recip", "shape": [1, 720, 720, 1], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/block_3/conv1/weights", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/block_3/conv1/biases", "shape": [128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/block_3/conv2/weights", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/block_3/conv2/biases", "shape": [128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/block_2/conv1/weights", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/block_2/conv1/biases", "shape": [128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/block_2/conv2/weights", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/block_2/conv2/biases", "shape": [128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/block_1/conv1/weights", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/block_1/conv1/biases", "shape": [128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/block_1/conv2/weights", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/block_1/conv2/biases", "shape": [128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/block_0/conv1/weights", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/block_0/conv1/biases", "shape": [128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/block_0/conv2/weights", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/block_0/conv2/biases", "shape": [128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/Conv_3/weights", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/Conv_3/biases", "shape": [64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/Conv_4/weights", "shape": [3, 3, 64, 128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/Conv_4/biases", "shape": [128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/Conv_5/weights", "shape": [3, 3, 128, 64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/Conv_5/biases", "shape": [64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/ResizeBilinear/size", "shape": [2], "dtype": "int32"}, {"name": "generator/Conv_1/weights", "shape": [3, 3, 32, 32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/Conv_1/biases", "shape": [32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/Conv_2/weights", "shape": [3, 3, 32, 64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/Conv_2/biases", "shape": [64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/Conv_6/weights", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/Conv_6/biases", "shape": [64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/Conv_7/weights", "shape": [3, 3, 64, 32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/Conv_7/biases", "shape": [32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/ResizeBilinear_1/size", "shape": [2], "dtype": "int32"}, {"name": "generator/Conv/weights", "shape": [7, 7, 3, 32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/Conv/biases", "shape": [32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/Conv_8/weights", "shape": [3, 3, 32, 32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/Conv_8/biases", "shape": [32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/Conv_9/weights", "shape": [7, 7, 32, 3], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "generator/Conv_9/biases", "shape": [3], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "depthwise_2/filter_in", "shape": [3, 3, 3, 1], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "ConstantFolding/truediv_1_recip", "shape": [1, 720, 720, 1], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "depthwise_4/filter_in", "shape": [3, 3, 3, 1], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "ConstantFolding/truediv_3_recip", "shape": [1, 720, 720, 1], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "add/y", "shape": [], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "depthwise_1/filter_in", "shape": [3, 3, 3, 1], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "ConstantFolding/truediv_recip", "shape": [1, 720, 720, 1], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "depthwise_6/filter_in", "shape": [3, 3, 3, 1], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "ConstantFolding/truediv_6_recip", "shape": [1, 720, 720, 1], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}]}]}