{
  "format": "graph-model",
  "generatedBy": "2.9.1",
  "convertedBy": "TensorFlow.js Converter v3.18.0",
  "signature":
  {
      "inputs":
      {
          "generator_input_tf_0_ee2363c7": {"name":"generator_input_tf_0_ee2363c7:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"-1"},{"size":"-1"},{"size":"3"}]}}
      },
      "outputs":
      {
          "generator/G_MODEL/out_layer/Tanh:0": {"name":"Identity:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"-1"},{"size":"-1"},{"size":"-1"},{"size":"3"}]}}
      }
  },
  "modelTopology":
  {
      "node":
      [
          {"name":"unknown_78","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"32"},{"size":"1"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/All_15","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_BOOL","tensorShape":{}}},"dtype":{"type":"DT_BOOL"}}},
          {"name":"StatefulPartitionedCall/Const_30","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"8"}]}}}}},
          {"name":"unknown_75","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"64"},{"size":"1"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/All_14","op":"Const","attr":{"dtype":{"type":"DT_BOOL"},"value":{"tensor":{"dtype":"DT_BOOL","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/Const_28","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"8"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"unknown_72","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"64"},{"size":"1"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/All_13","op":"Const","attr":{"dtype":{"type":"DT_BOOL"},"value":{"tensor":{"dtype":"DT_BOOL","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/Const_26","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"8"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/strided_slice_22/stack","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/strided_slice_22/stack_1","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/strided_slice_22/stack_2","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/Equal_2/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/strided_slice_23/stack","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/strided_slice_23/stack_1","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/strided_slice_23/stack_2","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/Equal_3/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/E/strided_slice/begin","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/E/strided_slice/size","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/E/resize/size_Unsqueeze__296/dim","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/E/strided_slice_1/begin","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/E/strided_slice_1/size","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/E/resize/size_Unsqueeze__297/dim","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/E/resize/size_Concat__298/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"unknown_69","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"128"},{"size":"1"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/All_12","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_BOOL","tensorShape":{}}},"dtype":{"type":"DT_BOOL"}}},
          {"name":"StatefulPartitionedCall/Const_24","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"8"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"unknown_66","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"128"},{"size":"1"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/All_11","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_BOOL","tensorShape":{}}},"dtype":{"type":"DT_BOOL"}}},
          {"name":"StatefulPartitionedCall/Const_22","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"8"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/strided_slice_9/stack","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/strided_slice_9/stack_1","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/strided_slice_9/stack_2","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/Equal/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/strided_slice_10/stack","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/strided_slice_10/stack_1","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/strided_slice_10/stack_2","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/Equal_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"unknown_63","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/D/strided_slice/begin","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/D/strided_slice/size","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/D/resize/size_Unsqueeze__250/dim","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"unknown_62","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/D/strided_slice_1/begin","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/D/strided_slice_1/size","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/D/resize/size_Unsqueeze__251/dim","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/D/resize/size_Concat__252/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"unknown_60","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"128"},{"size":"1"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/All_10","op":"Const","attr":{"dtype":{"type":"DT_BOOL"},"value":{"tensor":{"dtype":"DT_BOOL","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/Const_20","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"8"}]}}}}},
          {"name":"unknown_57","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"256"},{"size":"1"},{"size":"1"}]}}}}},
          {"name":"unknown_54","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"512"},{"size":"1"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/All_9","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_BOOL","tensorShape":{}}},"dtype":{"type":"DT_BOOL"}}},
          {"name":"StatefulPartitionedCall/Const_18","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"8"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"unknown_50","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"512"},{"size":"1"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"unknown_47","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"256"},{"size":"1"},{"size":"1"}]}}}}},
          {"name":"unknown_44","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"512"},{"size":"1"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/All_8","op":"Const","attr":{"dtype":{"type":"DT_BOOL"},"value":{"tensor":{"dtype":"DT_BOOL","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/Const_16","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"8"}]}}}}},
          {"name":"unknown_40","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"512"},{"size":"1"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"unknown_37","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"256"},{"size":"1"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"unknown_34","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"512"},{"size":"1"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/All_7","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_BOOL","tensorShape":{}}},"dtype":{"type":"DT_BOOL"}}},
          {"name":"StatefulPartitionedCall/Const_14","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"8"}]}}}}},
          {"name":"unknown_30","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"512"},{"size":"1"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"unknown_27","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"256"},{"size":"1"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"unknown_24","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"256"},{"size":"1"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/All_6","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_BOOL","tensorShape":{}}},"dtype":{"type":"DT_BOOL"}}},
          {"name":"StatefulPartitionedCall/Const_12","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"8"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"unknown_20","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"256"},{"size":"1"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"unknown_17","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"128"},{"size":"1"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/All_5","op":"Const","attr":{"dtype":{"type":"DT_BOOL"},"value":{"tensor":{"dtype":"DT_BOOL","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/Const_10","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"8"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"unknown_14","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"128"},{"size":"1"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/All_4","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_BOOL","tensorShape":{}}},"dtype":{"type":"DT_BOOL"}}},
          {"name":"StatefulPartitionedCall/Const_8","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"8"}]}}}}},
          {"name":"unknown_11","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"128"},{"size":"1"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/All_3","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_BOOL","tensorShape":{}}},"dtype":{"type":"DT_BOOL"}}},
          {"name":"StatefulPartitionedCall/Const_6","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"8"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"unknown_8","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"64"},{"size":"1"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/All_2","op":"Const","attr":{"dtype":{"type":"DT_BOOL"},"value":{"tensor":{"dtype":"DT_BOOL","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/Const_4","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"8"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"unknown_5","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"64"},{"size":"1"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/All_1","op":"Const","attr":{"dtype":{"type":"DT_BOOL"},"value":{"tensor":{"dtype":"DT_BOOL","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/Const_2","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"8"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"unknown_2","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"32"},{"size":"1"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/All","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_BOOL","tensorShape":{}}},"dtype":{"type":"DT_BOOL"}}},
          {"name":"StatefulPartitionedCall/Const","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"8"}]}}}}},
          {"name":"StatefulPartitionedCall/split","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"7"},{"size":"7"},{"size":"3"},{"size":"32"}]}}}}},
          {"name":"StatefulPartitionedCall/transpose_2/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/A/LayerNorm/moments/mean/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/A/LayerNorm/moments/variance/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"unknown_1","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"32"},{"size":"1"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/transpose_4/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/split_1","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"64"}]}}}}},
          {"name":"StatefulPartitionedCall/transpose_5/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/A/LayerNorm_1/moments/mean/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/A/LayerNorm_1/moments/variance/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}}}},
          {"name":"unknown_4","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"64"},{"size":"1"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/transpose_7/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/split_2","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/transpose_8/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/A/LayerNorm_2/moments/mean/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/A/LayerNorm_2/moments/variance/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}}}},
          {"name":"unknown_7","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"64"},{"size":"1"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/transpose_10/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/split_3","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/transpose_11/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/B/LayerNorm/moments/mean/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/B/LayerNorm/moments/variance/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}}}},
          {"name":"unknown_10","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"128"},{"size":"1"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/transpose_13/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/split_4","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"128"}]}}}}},
          {"name":"StatefulPartitionedCall/transpose_14/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/B/LayerNorm_1/moments/mean/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/B/LayerNorm_1/moments/variance/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}}}},
          {"name":"unknown_13","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"128"},{"size":"1"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/transpose_16/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/split_5","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/transpose_17/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/C/LayerNorm/moments/mean/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/C/LayerNorm/moments/variance/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}}}},
          {"name":"unknown_16","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"128"},{"size":"1"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/transpose_19/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/split_6","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"256"}]}}}}},
          {"name":"StatefulPartitionedCall/transpose_20/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/C/r1/LayerNorm/moments/mean/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/C/r1/LayerNorm/moments/variance/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}}}},
          {"name":"unknown_19","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"256"},{"size":"1"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/transpose_22/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"StatefulPartitionedCall/Reshape","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"1"}]}}}}},
          {"name":"unknown_22","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/transpose_23/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/C/r1/1/moments/mean/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/C/r1/1/moments/variance/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}}}},
          {"name":"unknown_23","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"256"},{"size":"1"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/transpose_25/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"StatefulPartitionedCall/split_7","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/transpose_26/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/C/r1/2/moments/mean/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/C/r1/2/moments/variance/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}}}},
          {"name":"unknown_26","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"256"},{"size":"1"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/transpose_28/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"StatefulPartitionedCall/split_8","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/transpose_29/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/C/r2/LayerNorm/moments/mean/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/C/r2/LayerNorm/moments/variance/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}}}},
          {"name":"unknown_29","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"512"},{"size":"1"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/transpose_31/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"StatefulPartitionedCall/Reshape_1","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"1"}]}}}}},
          {"name":"unknown_32","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/transpose_32/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/C/r2/1/moments/mean/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/C/r2/1/moments/variance/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"unknown_33","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"512"},{"size":"1"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/transpose_34/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/split_9","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"256"}]}}}}},
          {"name":"StatefulPartitionedCall/transpose_35/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/C/r2/2/moments/mean/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/C/r2/2/moments/variance/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"unknown_36","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"256"},{"size":"1"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/transpose_37/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"StatefulPartitionedCall/split_10","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/transpose_38/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/C/r3/LayerNorm/moments/mean/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/C/r3/LayerNorm/moments/variance/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}}}},
          {"name":"unknown_39","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"512"},{"size":"1"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/transpose_40/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/Reshape_2","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"1"}]}}}}},
          {"name":"unknown_42","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/transpose_41/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/C/r3/1/moments/mean/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/C/r3/1/moments/variance/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}}}},
          {"name":"unknown_43","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"512"},{"size":"1"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/transpose_43/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"StatefulPartitionedCall/split_11","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/transpose_44/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/C/r3/2/moments/mean/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/C/r3/2/moments/variance/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"unknown_46","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"256"},{"size":"1"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/transpose_46/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"StatefulPartitionedCall/split_12","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/transpose_47/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/C/r4/LayerNorm/moments/mean/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/C/r4/LayerNorm/moments/variance/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}}}},
          {"name":"unknown_49","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"512"},{"size":"1"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/transpose_49/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/Reshape_3","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"unknown_52","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/transpose_50/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/C/r4/1/moments/mean/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/C/r4/1/moments/variance/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"unknown_53","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"512"},{"size":"1"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/transpose_52/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/split_13","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/transpose_53/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/C/r4/2/moments/mean/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/C/r4/2/moments/variance/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"unknown_56","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"256"},{"size":"1"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/transpose_55/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/split_14","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"128"}]}}}}},
          {"name":"StatefulPartitionedCall/transpose_56/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/C/LayerNorm_1/moments/mean/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/C/LayerNorm_1/moments/variance/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}}}},
          {"name":"unknown_59","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"128"},{"size":"1"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_Gather__1355/axis","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_Slice__259/begin","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_Slice__259/size","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_Concat__264/axis","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/transpose_60/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"StatefulPartitionedCall/split_15","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/transpose_61/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/D/LayerNorm/moments/mean/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/D/LayerNorm/moments/variance/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"unknown_65","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"128"},{"size":"1"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/transpose_63/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"StatefulPartitionedCall/split_16","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"128"}]}}}}},
          {"name":"StatefulPartitionedCall/transpose_64/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/D/LayerNorm_1/moments/mean/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/D/LayerNorm_1/moments/variance/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"unknown_68","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"128"},{"size":"1"},{"size":"1"}]}}}}},
          {"name":"unknown_61","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_Gather__1370/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_Slice__305/begin","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_Slice__305/size","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_Concat__310/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/transpose_68/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/split_17","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"64"}]}}}}},
          {"name":"StatefulPartitionedCall/transpose_69/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/E/LayerNorm/moments/mean/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/E/LayerNorm/moments/variance/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"unknown_71","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"64"},{"size":"1"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/transpose_71/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"StatefulPartitionedCall/split_18","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/transpose_72/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/E/LayerNorm_1/moments/mean/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}}}},
          {"name":"StatefulPartitionedCall/onnx_tf_prefix_generator/G_MODEL/E/LayerNorm_1/moments/variance/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"unknown_74","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"64"},{"size":"1"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/transpose_74/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"StatefulPartitionedCall/split_19","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"7"},{"size":"7"},{"size":"64"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
